In [2]:
import pandas as pd
import numpy as np

###### data.replace(
    to_replace=None,
    value=None,
    inplace=False,
    limit=None,
    regex=False,
    method='pad',
)

###### to_replace : str, regex, list, dict, Series, int, float, or None
    How to find the values that will be replaced

In [3]:
ser = pd.Series([1, -999, 2, 1000, -999, 3])
ser

0       1
1    -999
2       2
3    1000
4    -999
5       3
dtype: int64

In [4]:
ser.replace(-999,np.nan)  #scalar

0       1.0
1       NaN
2       2.0
3    1000.0
4       NaN
5       3.0
dtype: float64

In [5]:
df = pd.DataFrame({"A":[0,1,2,3,4],
                   "B":[0,6,7,8,9]})
df

   A  B
0  0  0
1  1  6
2  2  7
3  3  8
4  4  9

In [6]:
df.replace(0,11)   #scalar value

    A   B
0  11  11
1   1   6
2   2   7
3   3   8
4   4   9

In [7]:
df.replace([0,1,2,3,4],5)  #list like to_replace value

   A  B
0  5  5
1  5  6
2  5  7
3  5  8
4  5  9

In [8]:
df.replace([0,1,2,3,4],[4,3,2,1,0])  #list like to replace values

   A  B
0  4  4
1  3  6
2  2  7
3  1  8
4  0  9

In [9]:
ser.replace([1,-999],method="bfill")

0       2
1       2
2       2
3    1000
4       3
5       3
dtype: int64

In [10]:
df.replace({0:222,4:555})   #dict_like to_replace

     A    B
0  222  222
1    1    6
2    2    7
3    3    8
4  555    9

In [11]:
df.replace({"A":1,"B":6},999)   #dict_like to_replace

     A    B
0    0    0
1  999  999
2    2    7
3    3    8
4    4    9

In [12]:
 #dict_like to_replace
df.replace({"A":{3:333,4:444}})

     A  B
0    0  0
1    1  6
2    2  7
3  333  8
4  444  9

In [13]:
ser.replace({-999:np.nan,1000:"world"})  #dict_like to_replace

0        1
1      NaN
2        2
3    world
4      NaN
5        3
dtype: object

In [14]:
raw_data = pd.DataFrame({"city":["Tripoli", "ssydney", "Tripoli", "Rome", "Rome", "Tripoli", "Rome", "Sydney","sydney"],
                        "Rank":["1st", "2nd", "1st", "2nd", "1st", "2nd", "1st", "2nd", "1st"],
                        "score1": [44,49,39,41,44,34,54,61,41],
                        "score2": [67,63,64,55,70,34,66,52,40]})
raw_data

      city Rank  score1  score2
0  Tripoli  1st      44      67
1  ssydney  2nd      49      63
2  Tripoli  1st      39      64
3     Rome  2nd      41      55
4     Rome  1st      44      70
5  Tripoli  2nd      34      34
6     Rome  1st      54      66
7   Sydney  2nd      61      52
8   sydney  1st      41      40

In [15]:
raw_data["city"]

0    Tripoli
1    ssydney
2    Tripoli
3       Rome
4       Rome
5    Tripoli
6       Rome
7     Sydney
8     sydney
Name: city, dtype: object

In [19]:
raw_data.replace("Tripoli","Napoli")

      city Rank  score1  score2
0   Napoli  1st      44      67
1  ssydney  2nd      49      63
2   Napoli  1st      39      64
3     Rome  2nd      41      55
4     Rome  1st      44      70
5   Napoli  2nd      34      34
6     Rome  1st      54      66
7   Sydney  2nd      61      52
8   sydney  1st      41      40